package main

import (
	"fmt"
)

/*

	冒泡排序法

输出：


--------没排序前--------
 [21 32 12 33 34 34 87 24]
--------第 1 次冒泡--------
[21 12 32 33 34 34 24 87]
--------第 2 次冒泡--------
[12 21 32 33 34 24 34 87]
--------第 3 次冒泡--------
[12 21 32 33 24 34 34 87]
--------第 4 次冒泡--------
[12 21 32 24 33 34 34 87]
--------第 5 次冒泡--------
[12 21 24 32 33 34 34 87]
--------第 6 次冒泡--------
[12 21 24 32 33 34 34 87]
--------第 7 次冒泡--------
[12 21 24 32 33 34 34 87]
--------最终结果--------
 [12 21 24 32 33 34 34 87]

*/

func main() {

	arr := [...]int{21, 32, 12, 33, 34, 34, 87, 24}

	var count = len(arr)

	fmt.Println("--------没排序前--------\n", arr)

	for i := 0; i < count-1; i++ {
		fmt.Println("--------第", i+1, "次冒泡--------")
		for j := 0; j < count-1-i; j++ {
			if arr[j] > arr[j+1] {
				temp := arr[j]
				arr[j] = arr[j+1]
				arr[j+1] = temp
			}
		}
		fmt.Println(arr)

	}
	fmt.Println("--------最终结果--------\n", arr)
}
